app/views/items/_form.html.erb

SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
---
    <%= f.label :category %>
		<%= collection_select(:item, :category_id, Category.find(:all), :id, :name) %>