app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('Pizza', '2011-04-25 07:14:05.551092', '2011-04-25 07:14:05.551092')