app/controllers/items_controller.rb

  def index
     @items = Item.find(:all, :order => 'created_at ASC')
     @items_by_category = @items.group_by(&:category)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
SELECT "items".* FROM "items" ORDER BY created_at DESC

  def create
    @item = Item.new(params[:item])
      if @item.save
---
INSERT INTO "items" ("number", "title", "description", "price", "created_at", "updated_at", "category_id") VALUES (1, 'Margaritta', 'tomatsaus, ost', '90 /180', '2011-04-25 06:55:14.850377', '2011-04-25 06:55:14.850377', NULL)

  def update
    @item = Item.find(params[:id])
      if @item.update_attributes(params[:item])
---
SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
UPDATE "items" SET "description" = 'tomatsaus, ost, cheese, ham, eggs, tuna, shrimp, onion, cucumber', "updated_at" = '2011-05-09 12:23:26.885325' WHERE "items"."id" = 2